Revit 2023 API
BuiltInFailures.SketchFailures.InvalidAreaLoadSketchError Property
 Area Load has invalid Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static FailureDefinitionId InvalidAreaLoadSketchError { get; }
Visual Basic
Public Shared ReadOnly Property InvalidAreaLoadSketchError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidAreaLoadSketchError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace